{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional_13",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [null, 256, 256, 1],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_13"
                        },
                        "name": "input_layer_13",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_247",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 32,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_247",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 256, 256, 1],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "input_layer_13",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_248",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 32,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_248",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 256, 256, 32],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_247",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_52",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_52",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 256, 256, 32],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_248",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_249",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_249",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 128, 128, 32],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "max_pooling2d_52",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_250",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_250",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 128, 128, 64],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_249",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_53",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_53",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 128, 128, 64],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_250",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_251",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_251",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 64, 64, 64],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "max_pooling2d_53",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_252",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_252",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 64, 64, 128],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_251",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_54",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_54",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 64, 64, 128],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_252",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_253",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_253",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 32, 32, 128],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "max_pooling2d_54",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_254",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_254",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 32, 32, 256],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_253",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_55",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_55",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 32, 32, 256],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_254",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_255",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 512,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_255",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 16, 16, 256],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "max_pooling2d_55",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_256",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 512,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_256",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 16, 16, 512],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_255",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2DTranspose",
                        "config": {
                            "name": "conv2d_transpose_52",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [2, 2],
                            "strides": [2, 2],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_transpose_52",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 16, 16, 512],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_256",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Concatenate",
                        "config": {
                            "name": "concatenate_52",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "axis": -1
                        },
                        "name": "concatenate_52",
                        "inbound_nodes": [
                            {
                                "args": [
                                    [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [null, 32, 32, 256],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "conv2d_transpose_52",
                                                    0,
                                                    0
                                                ]
                                            }
                                        },
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [null, 32, 32, 256],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "conv2d_254",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ]
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_257",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_257",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 32, 32, 512],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "concatenate_52",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_258",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_258",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 32, 32, 256],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_257",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2DTranspose",
                        "config": {
                            "name": "conv2d_transpose_53",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [2, 2],
                            "strides": [2, 2],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_transpose_53",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [null, 32, 32, 256],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_258",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
