{
    "format": "layers-model",
    "generatedBy": "keras v2.1.1",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "2.1.1",
        "backend": "tensorflow",
        "model_config": {
            "config": {
                "input_layers": [["input_1", 0, 0]],
                "layers": [
                    {
                        "config": {
                            "name": "input_1",
                            "batch_input_shape": [null, 256, 256, 1],
                            "dtype": "float32",
                            "sparse": false
                        },
                        "name": "input_1",
                        "inbound_nodes": [],
                        "class_name": "InputLayer"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_1",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 32,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_1",
                        "inbound_nodes": [[["input_1", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_2",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 32,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_2",
                        "inbound_nodes": [[["conv2d_1", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "strides": [2, 2],
                            "data_format": "channels_last",
                            "padding": "valid",
                            "pool_size": [2, 2]
                        },
                        "name": "max_pooling2d_1",
                        "inbound_nodes": [[["conv2d_2", 0, 0, {}]]],
                        "class_name": "MaxPooling2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_3",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 64,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_3",
                        "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_4",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 64,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_4",
                        "inbound_nodes": [[["conv2d_3", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "name": "max_pooling2d_2",
                            "trainable": true,
                            "strides": [2, 2],
                            "data_format": "channels_last",
                            "padding": "valid",
                            "pool_size": [2, 2]
                        },
                        "name": "max_pooling2d_2",
                        "inbound_nodes": [[["conv2d_4", 0, 0, {}]]],
                        "class_name": "MaxPooling2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_5",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 128,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_5",
                        "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_6",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 128,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_6",
                        "inbound_nodes": [[["conv2d_5", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "name": "max_pooling2d_3",
                            "trainable": true,
                            "strides": [2, 2],
                            "data_format": "channels_last",
                            "padding": "valid",
                            "pool_size": [2, 2]
                        },
                        "name": "max_pooling2d_3",
                        "inbound_nodes": [[["conv2d_6", 0, 0, {}]]],
                        "class_name": "MaxPooling2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_7",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 256,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_7",
                        "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_8",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 256,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_8",
                        "inbound_nodes": [[["conv2d_7", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "name": "max_pooling2d_4",
                            "trainable": true,
                            "strides": [2, 2],
                            "data_format": "channels_last",
                            "padding": "valid",
                            "pool_size": [2, 2]
                        },
                        "name": "max_pooling2d_4",
                        "inbound_nodes": [[["conv2d_8", 0, 0, {}]]],
                        "class_name": "MaxPooling2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_9",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 512,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_9",
                        "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_10",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 512,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_10",
                        "inbound_nodes": [[["conv2d_9", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_transpose_1",
                            "activation": "linear",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [2, 2],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 256,
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [2, 2],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_transpose_1",
                        "inbound_nodes": [[["conv2d_10", 0, 0, {}]]],
                        "class_name": "Conv2DTranspose"
                    },
                    {
                        "config": {
                            "name": "concatenate_1",
                            "axis": 3,
                            "trainable": true
                        },
                        "name": "concatenate_1",
                        "inbound_nodes": [
                            [
                                ["conv2d_transpose_1", 0, 0, {}],
                                ["conv2d_8", 0, 0, {}]
                            ]
                        ],
                        "class_name": "Concatenate"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_11",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 256,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_11",
                        "inbound_nodes": [[["concatenate_1", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_12",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 256,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_12",
                        "inbound_nodes": [[["conv2d_11", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_transpose_2",
                            "activation": "linear",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [2, 2],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 128,
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [2, 2],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_transpose_2",
                        "inbound_nodes": [[["conv2d_12", 0, 0, {}]]],
                        "class_name": "Conv2DTranspose"
                    },
                    {
                        "config": {
                            "name": "concatenate_2",
                            "axis": 3,
                            "trainable": true
                        },
                        "name": "concatenate_2",
                        "inbound_nodes": [
                            [
                                ["conv2d_transpose_2", 0, 0, {}],
                                ["conv2d_6", 0, 0, {}]
                            ]
                        ],
                        "class_name": "Concatenate"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_13",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 128,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_13",
                        "inbound_nodes": [[["concatenate_2", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_14",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 128,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_14",
                        "inbound_nodes": [[["conv2d_13", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_transpose_3",
                            "activation": "linear",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [2, 2],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 64,
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [2, 2],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_transpose_3",
                        "inbound_nodes": [[["conv2d_14", 0, 0, {}]]],
                        "class_name": "Conv2DTranspose"
                    },
                    {
                        "config": {
                            "name": "concatenate_3",
                            "axis": 3,
                            "trainable": true
                        },
                        "name": "concatenate_3",
                        "inbound_nodes": [
                            [
                                ["conv2d_transpose_3", 0, 0, {}],
                                ["conv2d_4", 0, 0, {}]
                            ]
                        ],
                        "class_name": "Concatenate"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_15",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 64,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_15",
                        "inbound_nodes": [[["concatenate_3", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_16",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 64,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_16",
                        "inbound_nodes": [[["conv2d_15", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_transpose_4",
                            "activation": "linear",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [2, 2],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 32,
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [2, 2],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_transpose_4",
                        "inbound_nodes": [[["conv2d_16", 0, 0, {}]]],
                        "class_name": "Conv2DTranspose"
                    },
                    {
                        "config": {
                            "name": "concatenate_4",
                            "axis": 3,
                            "trainable": true
                        },
                        "name": "concatenate_4",
                        "inbound_nodes": [
                            [
                                ["conv2d_transpose_4", 0, 0, {}],
                                ["conv2d_2", 0, 0, {}]
                            ]
                        ],
                        "class_name": "Concatenate"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_17",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 32,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_17",
                        "inbound_nodes": [[["concatenate_4", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_18",
                            "activation": "relu",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "same",
                            "kernel_constraint": null,
                            "filters": 32,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [3, 3],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_18",
                        "inbound_nodes": [[["conv2d_17", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    },
                    {
                        "config": {
                            "activity_regularizer": null,
                            "name": "conv2d_19",
                            "activation": "sigmoid",
                            "trainable": true,
                            "bias_regularizer": null,
                            "strides": [1, 1],
                            "padding": "valid",
                            "kernel_constraint": null,
                            "filters": 1,
                            "dilation_rate": [1, 1],
                            "bias_constraint": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "mode": "fan_avg"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "data_format": "channels_last",
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "use_bias": true,
                            "kernel_size": [1, 1],
                            "kernel_regularizer": null
                        },
                        "name": "conv2d_19",
                        "inbound_nodes": [[["conv2d_18", 0, 0, {}]]],
                        "class_name": "Conv2D"
                    }
                ],
                "name": "model_1",
                "output_layers": [["conv2d_19", 0, 0]]
            },
            "class_name": "Model"
        },
        "training_config": {
            "sample_weight_mode": null,
            "metrics": ["dice_coef"],
            "loss": "dice_coef_loss",
            "loss_weights": null,
            "optimizer_config": {
                "config": {
                    "beta_2": 0.9990000128746033,
                    "beta_1": 0.8999999761581421,
                    "lr": 9.999999747378752e-5,
                    "decay": 0.0,
                    "epsilon": 1e-8
                },
                "class_name": "Adam"
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of8.bin",
                "group1-shard2of8.bin",
                "group1-shard3of8.bin",
                "group1-shard4of8.bin",
                "group1-shard5of8.bin",
                "group1-shard6of8.bin",
                "group1-shard7of8.bin",
                "group1-shard8of8.bin"
            ],
            "weights": [
                {
                    "name": "conv2d_1/kernel",
                    "shape": [3, 3, 1, 32],
                    "dtype": "float32"
                },
                { "name": "conv2d_1/bias", "shape": [32], "dtype": "float32" },
                {
                    "name": "conv2d_10/kernel",
                    "shape": [3, 3, 512, 512],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_10/bias",
                    "shape": [512],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_11/kernel",
                    "shape": [3, 3, 512, 256],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_11/bias",
                    "shape": [256],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_12/kernel",
                    "shape": [3, 3, 256, 256],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_12/bias",
                    "shape": [256],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_13/kernel",
                    "shape": [3, 3, 256, 128],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_13/bias",
                    "shape": [128],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_14/kernel",
                    "shape": [3, 3, 128, 128],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_14/bias",
                    "shape": [128],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_15/kernel",
                    "shape": [3, 3, 128, 64],
                    "dtype": "float32"
                },
                { "name": "conv2d_15/bias", "shape": [64], "dtype": "float32" },
                {
                    "name": "conv2d_16/kernel",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                { "name": "conv2d_16/bias", "shape": [64], "dtype": "float32" },
                {
                    "name": "conv2d_17/kernel",
                    "shape": [3, 3, 64, 32],
                    "dtype": "float32"
                },
                { "name": "conv2d_17/bias", "shape": [32], "dtype": "float32" },
                {
                    "name": "conv2d_18/kernel",
                    "shape": [3, 3, 32, 32],
                    "dtype": "float32"
                },
                { "name": "conv2d_18/bias", "shape": [32], "dtype": "float32" },
                {
                    "name": "conv2d_19/kernel",
                    "shape": [1, 1, 32, 1],
                    "dtype": "float32"
                },
                { "name": "conv2d_19/bias", "shape": [1], "dtype": "float32" },
                {
                    "name": "conv2d_2/kernel",
                    "shape": [3, 3, 32, 32],
                    "dtype": "float32"
                },
                { "name": "conv2d_2/bias", "shape": [32], "dtype": "float32" },
                {
                    "name": "conv2d_3/kernel",
                    "shape": [3, 3, 32, 64],
                    "dtype": "float32"
                },
                { "name": "conv2d_3/bias", "shape": [64], "dtype": "float32" },
                {
                    "name": "conv2d_4/kernel",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                { "name": "conv2d_4/bias", "shape": [64], "dtype": "float32" },
                {
                    "name": "conv2d_5/kernel",
                    "shape": [3, 3, 64, 128],
                    "dtype": "float32"
                },
                { "name": "conv2d_5/bias", "shape": [128], "dtype": "float32" },
                {
                    "name": "conv2d_6/kernel",
                    "shape": [3, 3, 128, 128],
                    "dtype": "float32"
                },
                { "name": "conv2d_6/bias", "shape": [128], "dtype": "float32" },
                {
                    "name": "conv2d_7/kernel",
                    "shape": [3, 3, 128, 256],
                    "dtype": "float32"
                },
                { "name": "conv2d_7/bias", "shape": [256], "dtype": "float32" },
                {
                    "name": "conv2d_8/kernel",
                    "shape": [3, 3, 256, 256],
                    "dtype": "float32"
                },
                { "name": "conv2d_8/bias", "shape": [256], "dtype": "float32" },
                {
                    "name": "conv2d_9/kernel",
                    "shape": [3, 3, 256, 512],
                    "dtype": "float32"
                },
                { "name": "conv2d_9/bias", "shape": [512], "dtype": "float32" },
                {
